# Deep dive — groupby() + aggregation (Pandas)
## Big idea — Split → Apply → Combine

#### groupby() does exactly three things:

Split the DataFrame into groups based on key(s) (column values, functions, or index).

Apply a function to each group (aggregate, transform, custom).

Combine the results back into a DataFrame/Series.

This pattern powers most summary/summary-by operations: totals, averages, counts, top-N per group, rolling stats per group, etc.

In [2]:
import pandas as pd

data = {
    'Department': ['IT','HR','IT','HR','Finance','IT','Finance'],
    'Employee':  ['Pavan','Ravi','Anu','Sneha','Arjun','Riya','Divya'],
    'Salary':    [50000,45000,52000,48000,55000,53000,60000],
    'Experience':[2,3,4,5,3,2,6]
}
df = pd.DataFrame(data)

In [3]:
df

  Department Employee  Salary  Experience
0         IT    Pavan   50000           2
1         HR     Ravi   45000           3
2         IT      Anu   52000           4
3         HR    Sneha   48000           5
4    Finance    Arjun   55000           3
5         IT     Riya   53000           2
6    Finance    Divya   60000           6

### Mean salary by department:

What happens:

Groups created for 'Finance', 'HR', 'IT'.

For each group Pandas computes mean of Salary.

Result is a Series with group labels as index.

In [5]:
df.groupby('Department')['Salary'].mean()
### Mean salary by department:

Department
Finance    57500.000000
HR         46500.000000
IT         51666.666667
Name: Salary, dtype: float64

###  Aggregating multiple columns

In [7]:
df.groupby('Department')[['Salary','Experience']].mean().max()

Salary        57500.0
Experience        4.5
dtype: float64

4) Multiple aggregations: .agg() and .aggregate()

.agg() accepts:

a single function ('mean')

a list of functions (['mean','sum'])

a dict mapping column → function(s)

named aggregation (since pandas 0.25+), which produces clean column names

In [11]:
# same agg for multiple numeric columns (exclude non-numeric 'Employee' column)
df.groupby('Department')[['Salary','Experience']].agg(['mean','max'])

# different aggs per column (apply numeric aggs only to numeric columns)
df.groupby('Department').agg({'Salary':['mean','max'], 'Experience':'sum'})

                  Salary        Experience
                    mean    max        sum
Department
Finance     57500.000000  60000          9
HR          46500.000000  48000          8
IT          51666.666667  53000          8

### Named aggregation (cleaner column names):

In [12]:
df.groupby('Department').agg(
    avg_salary = ('Salary','mean'),
    max_salary = ('Salary','max'),
    total_experience = ('Experience','sum')
).reset_index()

  Department    avg_salary  max_salary  total_experience
0    Finance  57500.000000       60000                 9
1         HR  46500.000000       48000                 8
2         IT  51666.666667       53000                 8

 ### 5) .size() vs .count()

groupby.size() → counts rows per group (including NaNs in other columns). Returns Series.

groupby['col'].count() → counts non-null values of col per group.

In [ ]:
df.groupby('Department').size()

Department
Finance    2
HR         2
IT         3
dtype: int64

In [17]:
df.groupby('Department')['Salary'].count()

Department
Finance    2
HR         2
IT         3
Name: Salary, dtype: int64

###   6 as_index and reset_index

By default groupby() returns group labels as the index. Use reset_index() or as_index=False to keep them as columns.

In [19]:
# df.groupby('Department', as_index=False)['Salary'].mean()
# OR
df.groupby('Department')['Salary'].mean().reset_index()

  Department        Salary
0    Finance  57500.000000
1         HR  46500.000000
2         IT  51666.666667

### Group by multiple keys

In [21]:
df.groupby(['Department','Experience'])['Salary'].mean()

Department  Experience
Finance     3             55000.0
            6             60000.0
HR          3             45000.0
            5             48000.0
IT          2             51500.0
            4             52000.0
Name: Salary, dtype: float64

###  Iterating groups
 
name is group label; group is a DataFrame with rows in that group.

In [22]:
g = df.groupby('Department')
for name, group in g:
    print(name)
    print(group)

Finance
  Department Employee  Salary  Experience
4    Finance    Arjun   55000           3
6    Finance    Divya   60000           6
HR
  Department Employee  Salary  Experience
1         HR     Ravi   45000           3
3         HR    Sneha   48000           5
IT
  Department Employee  Salary  Experience
0         IT    Pavan   50000           2
2         IT      Anu   52000           4
5         IT     Riya   53000           2

21) Short summary

groupby() is the core tool for summarizing by groups.

Use .agg() / named aggregation for clean multi-column summaries.

Use .transform() to broadcast group-level results back to rows.

Use .apply() for group-wise custom ops when necessary.

Grouper is your friend for time-series grouping.

pivot_table offers alternative with easy reshape.